app/views/eventos/_form.html.erb

    <div class="controls">
      <%=
      select_tag 'colmeias[id][]', options_for_select(Colmeia.all.map {|s| [s.nome, s.id]},
:selected => @evento.colmeias.map {|j| [j.nome, j.id]}), :multiple => true
---
SELECT "colmeias".* FROM "colmeias" INNER JOIN "colmeias_eventos" ON "colmeias"."id" = "colmeias_eventos"."colmeia_id" WHERE "colmeias_eventos"."evento_id" = 1