app/views/eventos/index.html.erb

SELECT "colmeias".* FROM "colmeias" INNER JOIN "colmeias_eventos" ON "colmeias"."id" = "colmeias_eventos"."colmeia_id" WHERE "colmeias_eventos"."evento_id" = 1
---
        <td><%= evento.tipo_evento.nome %></td>
        <td><%= evento.colmeias.length %></td>