app/controllers/colmeias_controller.rb

  def index
    @colmeias = Colmeia.all
---
SELECT "colmeias".* FROM "colmeias"

  def show
    @colmeia = Colmeia.find(params[:id])
---
SELECT "colmeias".* FROM "colmeias" WHERE "colmeias"."id" = ? LIMIT 1  [["id", "1"]]

  def new
    @colmeia = Colmeia.new
    @areas = Area.all
---
SELECT "areas".* FROM "areas"

  def edit
    @areas = Area.all
    @colmeia = Colmeia.find(params[:id])
---
SELECT "areas".* FROM "areas"
SELECT "colmeias".* FROM "colmeias" WHERE "colmeias"."id" = ? LIMIT 1  [["id", "1"]]

  def create

    @colmeia = Colmeia.new(params[:colmeia])

    respond_to do |format|
      if @colmeia.save
---
INSERT INTO "colmeias" ("area_id", "created_at", "nome", "updated_at") VALUES (?, ?, ?, ?)  [["area_id", nil], ["created_at", Mon, 25 Jun 2012 00:12:46 UTC +00:00], ["nome", "1"], ["updated_at", Mon, 25 Jun 2012 00:12:46 UTC +00:00]]

  def update
    @colmeia = Colmeia.find(params[:id])

    respond_to do |format|
      if @colmeia.update_attributes(params[:colmeia])
---
SELECT "colmeias".* FROM "colmeias" WHERE "colmeias"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "colmeias" SET "nome" = 'colmeia 2', "updated_at" = '2012-06-25 00:35:11.833003' WHERE "colmeias"."id" = 1