app/controllers/eventos_controller.rb

SELECT "eventos".* FROM "eventos"
---
  def index
    @eventos = Evento.all

SELECT "tipo_eventos".* FROM "tipo_eventos" WHERE "tipo_eventos"."id" = 1 LIMIT 1
---
  def show
    @evento = Evento.find(params[:id])

SELECT "tipo_eventos".* FROM "tipo_eventos"
---
  def new
    @evento = Evento.new
    @tipo_eventos = TipoEvento.all

SELECT "tipo_eventos".* FROM "tipo_eventos"
SELECT "eventos".* FROM "eventos" WHERE "eventos"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit

    @tipo_eventos = TipoEvento.all
    @evento = Evento.find(params[:id])

INSERT INTO "eventos" ("created_at", "data_prevista", "data_realizada", "status", "tipo_evento_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @evento = Evento.new(params[:evento])

    respond_to do |format|
      if @evento.save

SELECT "eventos".* FROM "eventos" WHERE "eventos"."id" = ? LIMIT 1  [["id", "1"]]
---
  def update
    @evento = Evento.find(params[:id])

SELECT "eventos".* FROM "eventos" WHERE "eventos"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "eventos" WHERE "eventos"."id" = ?  [["id", 2]]
---
  def destroy
    @evento = Evento.find(params[:id])
    @evento.destroy