app/controllers/tipo_eventos_controller.rb

  def index
    @tipo_eventos = TipoEvento.all
---
SELECT "tipo_eventos".* FROM "tipo_eventos"

  def show
    @tipo_evento = TipoEvento.find(params[:id])
---
SELECT "tipo_eventos".* FROM "tipo_eventos" WHERE "tipo_eventos"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @tipo_evento = TipoEvento.new(params[:tipo_evento])

    respond_to do |format|
      if @tipo_evento.save
---
INSERT INTO "tipo_eventos" ("created_at", "nome", "periodo", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Mon, 25 Jun 2012 01:39:03 UTC +00:00], ["nome", "Trocar Rainha"], ["periodo", "anual"], ["updated_at", Mon, 25 Jun 2012 01:39:03 UTC +00:00]]